# На вход программе подаётся одна строка. Напишите программу, которая выводит:
# - общее количество символов в строке;
# - первые три символа строки;
# - последние три символа строки;
# - строку в обратном порядке;
# - строку с удалённым первым и последним символами.
# - предпоследний символ этой строки;
# - всю строку, кроме последних двух символов;
# - все символы с чётными индексами;
# - все символы с нечётными индексами;
# - все символы строки через один в обратном порядке, начиная с последнего.
#
# Формат входных данных
# На вход программе подаётся одна строка, длина которой больше 5 символов.
#
# Формат выходных данных
# Программа должна вывести данные в соответствии с условием. Каждое значение выводится на отдельной строке.
#
# Пример:
# Входные данные:
# abcdefghijklmnopqrstuvwxyz
# Выходные данные:
# 26
# abc
# xyz
# zyxwvutsrqponmlkjihgfedcba
# bcdefghijklmnopqrstuvwxy
# y
# abcdefghijklmnopqrstuvwx
# acegikmoqsuwy
# bdfhjlnprtvxz
# zxvtrpnljhfdb
