# Напишите программу, которая определяет, является ли прямоугольник квадратом.
#
# Формат входных данных
# На вход программе подаются два целых числа: длина и ширина.
#
# Формат выходных данных
# Программа должна вывести наименьшее из двух чисел.
# Программа должна вывести «Квадрат» (без кавычек), если длина и ширина одинаковые,
# или «Прямоугольник» (без кавычек) в противном случае.
#
# Пример 1:
# Входные данные:
# 7
# 7
# Выходные данные:
# Квадрат
#
# Пример 2:
# Входные данные:
# 8
# 5
# Выходные данные:
# Прямоугольник
