# Пользователь создаёт никнейм для своего аккаунта в соцсети Y. Правила для корректного никнейма в соцсети Y следующие:
# - никнейм должен начинаться с символа @
# - никнейм должен содержать от 5 до 15 (включительно) символов (включая первый символ @)
# - никнейм должен содержать только строчные буквы и (или) цифры (помимо первого символа @)
# Напишите программу, которая выводит «Correct» (без кавычек), если никнейм соответствует всем вышеприведенным правилам,
# или «Incorrect» (без кавычек) в противном случае.
#
# Формат входных данных
# На вход программе подаётся одна строка – никнейм.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Примечание. Обратите внимание, что никнейму необязательно содержать строчные буквы и цифры одновременно,
# никнейм может содержать только строчные буквы или только цифры (помимо первого символа @).
#
# Пример 1:
# Входные данные:
# @andrey52
# Выходные данные:
# Correct
#
# Пример 2:
# Входные данные:
# @GraffAndrey
# Выходные данные:
# Incorrect
