# Напишите программу, которая выводит на экран следующий текст:
# I***like***Python
# Обязательно использовать параметр sep
print('I', 'like', 'Python', sep='***')
