# Напишите программу, которая приветствует пользователя в следующем формате:
# Привет, <имя пользователя>!
# где <имя пользователя> – строка, которую ваша программа принимает на вход командой input().
# Обязательно использовать параметр end
name = input()
print('Привет,', name, end='!')
