# Достаем из копилки монеты, пока будет в сумме не менее 100 рублей. В результате вывести сколько всего денег
# достали из копилки в формате: "Я вытащил из копилки <сумма> руб."
#
# Формат входных данных
# На вход программе подаются номиналы монет (1, 2, 5, 10) пока в сумме не достигнет 100 рублей.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Пример:
# Входные данные:
# 10
# 5
# 2
# 10
# 10
# 5
# 10
# 10
# 1
# 10
# 10
# 5
# 5
# 10
# Выходные данные:
# Я вытащил из копилки 103 руб.
