# Можно поиграть в телефон, если выполнено три условия: ты убрал комнату, помыл посуду и сделал уроки.
# Программа задаёт три вопроса: "Ты убрал комнату? (да/нет)", "Ты помыл посуду? (да/нет)", "Ты сделал уроки? (да/нет)".
# Если ответ на все вопросы положительный, то программа выводит "Можно поиграть в телефон!",
# иначе "Сначала нужно сделать все дела!"
#
# Формат входных данных
# Программа задает три вопроса как написано выше.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Пример 1:
# Входные данные:
# да
# нет
# да
# Выходные данные:
# Сначала нужно сделать все дела!
#
# Пример 2:
# Входные данные:
# да
# да
# да
# Выходные данные:
# Можно поиграть в телефон!
