# Можно поиграть в телефон, если выполнено три условия: ты помыл посуду, сделал уроки и ты не наказан.
# Программа задаёт три вопроса: "Ты помыл посуду? (да/нет)", "Ты сделал уроки? (да/нет)", "Ты наказан? (да/нет)".
# Если ответ на первые два вопроса - да, а на последний - нет, то программа выводит "Можно поиграть в телефон!",
# иначе "Нельзя поиграть в телефон!"
#
# Формат входных данных
# Программа задает три вопроса как написано выше.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Пример 1:
# Входные данные:
# да
# да
# да
# Выходные данные:
# Нельзя поиграть в телефон!
#
# Пример 2:
# Входные данные:
# да
# да
# нет
# Выходные данные:
# Можно поиграть в телефон!
dishes_washed = input("Ты помыл посуду? (да/нет) ")
homework_done = input("Ты сделал уроки? (да/нет) ")
punished = input("Ты наказан? (да/нет) ")
