# Напишите программу, которая выводит треугольник, состоящий из звёздочек (*):
# *
# **
# ***
# ****
# *****
# ******
# *******
print('*')
print('**')
print('***')
print('****')
print('*****')
print('******')
print('*******')
print()
print('Я', 'учусь', 'программировать', 'на', 'Python!')
