# Напишите программу, которая принимает командой input() три строки,
# а затем выводит их в той же последовательности, каждую на отдельной строке.
#
# - Формат входных данных
# На вход программе подаются три строки, каждая на отдельной строке.
#
# - Формат выходных данных
# Программа должна вывести введённые строки в той же последовательности, каждую на отдельной строке.
name1 = input()
name2 = input()
name3 = input()
print(name1)
print(name2)
print(name3)
