# На вход программе подаётся строка текста – название футбольной команды.
# Напишите программу, которая принимает через команду input() эту строку и печатает предложение в следующем формате:
# <название футбольной команды> - чемпион!
# где <название футбольной команды> – строка текста, которую ваша программа приняла на вход.
team = input()
print(team, '- чемпион!')
