# Напишите программу, которая выводит последовательность чисел с одним пробелом между ними.
# Последовательность чисел: 1; 2; 4; 8; 16; 32
print("1", "2", "4 8 16 32")
print(1, 2, 4, 8, 16, 32)
