# Напишите программу, которая выводит на экран
# Здравствуй, мир!
print('Здравствуй, мир!')
