# Напишите программу, которая принимает командой input() три строки,
# а затем выводит их в обратной последовательности, каждую на отдельной строке.
#
# - Формат входных данных
# На вход программе подаются две строки, каждая на отдельной строке.
#
# - Формат выходных данных
# Программа должна вывести введённые строки в обратной последовательности, каждую на отдельной строке.
name1 = input()
name2 = input()
name3 = input()
print(name3)
print(name2)
print(name1)
