# Необходимо ввести правильный пароль. Пока пароль неверный, выводится сообщение
# "Неверный пароль, попробуй ещё раз."
# Когда пароль введен верно, выводится сообщение "Доступ разрешён!" и цикл завершается.
#
# Формат входных данных
# На вход программе подаются пароли до тех пор, пока не введен верный.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Пример:
# Входные данные:
# 1111
# 0000
# qwerty
# 1234
# Выходные данные:
# Доступ разрешён!

true_password = '1234'  # верный пароль
