# Программа спрашивает день недели (1–7, где 1 — понедельник) и предлагает завтрак:
# Понедельник, среда, пятница (1, 3, 5) - "Яичница"
# Вторник, четверг (2, 4) - "Творожная запеканка"
# Суббота, воскресенье (6, 7) - "Блины"
#
# Формат входных данных
# На вход программе подаётся одно целое число - день недели.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Пример 1:
# Входные данные:
# 3
# Выходные данные:
# Яичница
#
# Пример 2:
# Входные данные:
# 7
# Выходные данные:
# Блины
